{
    "title": "Homemade Pizza Dough Recipe for Beginners",
    "serving_size": "2 12-inch pizzas",
    "prep_time": "2 hours, 15 minutes",
    "ingredients": [
        "1 and 1/3 cups (320ml) warm water (between 100-110°F, 38-43°C)",
        "2 and 1/4 teaspoons (7g) Platinum Yeast from Red Star instant yeast *(1 standard packet)*",
        "1 Tablespoon (13g) granulated sugar",
        "2 Tablespoons (30ml) olive oil, plus more for pan and brushing on dough",
        "1 teaspoon salt",
        "3 and 1/2 cups (about 450g) unbleached all-purpose flour (spooned & leveled), plus more for hands and surface",
        "sprinkle of cornmeal for dusting the pan"
    ],
    "instructions": [
        "Whisk the warm water, yeast, and granulated sugar together in the bowl of your stand mixer fitted with a dough hook or paddle attachment. Cover and allow to rest for 5 minutes. *If you don't have a stand mixer, simply use a large mixing bowl and mix the dough with a wooden spoon or silicone spatula in the next step.",
        "Add the olive oil, salt, and flour. Beat on low speed for 2 minutes.",
        "Keep the dough in the mixer and beat for an additional 5 full minutes, or knead by hand on a lightly floured surface for 5 full minutes. If the dough becomes too sticky during the kneading process, sprinkle 1 teaspoon of flour at a time on the dough or on the work surface/in the bowl to make a soft, slightly tacky dough. Do not add more flour than you need because you do not want a dry dough. After kneading, the dough should still feel a little soft. Poke it with your finger—if it slowly bounces back, your dough is ready to rise. You can also do a “windowpane test” to see if your dough has been kneaded long enough: tear off a small (roughly golfball-size) piece of dough and gently stretch it out until it's thin enough for light to pass through it. Hold it up to a window or light. Does light pass through the stretched dough without the dough tearing first? If so, your dough has been kneaded long enough and is ready to rise. If not, keep kneading until it passes the windowpane test.",
        "Lightly grease a large bowl with oil or nonstick spray—just use the same bowl you used for the dough. Place the dough in the bowl, turning it to coat all sides in the oil. Cover the bowl with aluminum foil, plastic wrap, or a clean kitchen towel. Allow the dough to rise at room temperature for 60-90 minutes or until double in size. (Tip: For the warm environment on a particularly cold day, heat your oven to 150°F (66°C). Turn the oven off, place the dough inside, and keep the door slightly ajar. This will be a warm environment for your dough to rise. After about 30 minutes, close the oven door to trap the air inside with the rising dough. When it's doubled in size, remove from the oven.)",
        "Preheat oven to 475°F (246°C). Allow it to heat for at least 15-20 minutes as you shape the pizza. (If using a pizza stone, place it in the oven to preheat as well.) Lightly grease baking sheet or pizza pan with nonstick spray or olive oil. Sprinkle lightly with cornmeal, which gives the crust extra crunch and flavor.",
        "Shape the dough: When the dough is ready, punch it down to release any air bubbles. Divide the dough in half. (If not making 2 pizzas, freeze half of the dough for another time. See freezing instructions below.) On a lightly floured work surface using lightly floured hands or rolling pin, gently flatten the dough into a disc. Place on prepared pan and, using lightly floured hands, stretch and flatten the disc into a 12-inch circle, about 1/2-inch thick. If the dough keeps shrinking back as you try to stretch it, stop what you're doing, cover it lightly for 5-10 minutes, then try again. Once shaped into a 12-inch circle, lift the edge of the dough up to create a lip around the edges. I simply pinch the edges up to create the rim. If using a pizza stone, place the dough directly on baker's peels dusted with cornmeal.",
        "Cover dough lightly with plastic wrap or a clean kitchen towel and allow to rest for a few minutes as you prepare your pizza toppings. I suggest pepperoni & green peppers or jalapeño slices, Hawaiian pizza, pesto pizza, spinach artichoke white pizza, or homemade BBQ chicken pizza.",
        "Using your fingers, push dents into the surface of the dough to prevent bubbling. To prevent the filling from making your pizza crust soggy, brush the top lightly with olive oil. Top with your favorite toppings and bake for 13-15 minutes or until the crust is golden brown.",
        "Slice hot pizza and serve immediately. Cover leftover pizza tightly and store in the refrigerator. Reheat as you prefer. Baked pizza slices can be frozen up to 3 months."
    ]
}